In [1]:
import numpy as np
import pandas as pd

In [2]:
#comando concat, semelhante ao union all do sql

In [3]:
colunas = ['col1','col2','col3','col4']

In [4]:
dados1 =  np.array(list(map(lambda x: 'A' + str(x), range(16)))).reshape(4,4)
dados2 =  np.array(list(map(lambda x: 'B' + str(x), range(16)))).reshape(4,4)
dados3 =  np.array(list(map(lambda x: 'C' + str(x), range(16)))).reshape(4,4)
dados4 =  np.array(list(map(lambda x: 'D' + str(x), range(16)))).reshape(4,4)
dados5 =  np.array(list(map(lambda x: 'E' + str(x), range(16)))).reshape(4,4)

In [5]:
df1 = pd.DataFrame(dados1,columns=colunas)
df2 = pd.DataFrame(dados2,columns=colunas)
df3 = pd.DataFrame(dados3,columns=colunas)
df4 = pd.DataFrame(dados4,columns=colunas,index=[1,2,3,4])
df5 = pd.DataFrame(dados5,columns=colunas,index=[5,6,7,8])

In [6]:
df1

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15

In [7]:
df2

  col1 col2 col3 col4
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15

In [8]:
#select * from df1 union all select * from df2

In [9]:
pd.concat([df1,df2])

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15

In [10]:
pd.concat([df1,df2,df3])

  col1 col2 col3 col4
0   A0   A1   A2   A3
1   A4   A5   A6   A7
2   A8   A9  A10  A11
3  A12  A13  A14  A15
0   B0   B1   B2   B3
1   B4   B5   B6   B7
2   B8   B9  B10  B11
3  B12  B13  B14  B15
0   C0   C1   C2   C3
1   C4   C5   C6   C7
2   C8   C9  C10  C11
3  C12  C13  C14  C15

In [11]:
#select df1.col1, df1.col2, df2.col3, df2.col4 from df1 inner join df2 on 1 = 1

In [14]:
#semelhante a um join no sql
pd.concat([df1,df2],axis=1)

  col1 col2 col3 col4 col1 col2 col3 col4
0   A0   A1   A2   A3   B0   B1   B2   B3
1   A4   A5   A6   A7   B4   B5   B6   B7
2   A8   A9  A10  A11   B8   B9  B10  B11
3  A12  A13  A14  A15  B12  B13  B14  B15

In [16]:
df_teste = pd.concat([df1,df2,df3],axis=1)

In [17]:
df_teste['col1']

  col1 col1 col1
0   A0   B0   C0
1   A4   B4   C4
2   A8   B8   C8
3  A12  B12  C12

In [18]:
df4

  col1 col2 col3 col4
1   D0   D1   D2   D3
2   D4   D5   D6   D7
3   D8   D9  D10  D11
4  D12  D13  D14  D15

In [19]:
df5

  col1 col2 col3 col4
5   E0   E1   E2   E3
6   E4   E5   E6   E7
7   E8   E9  E10  E11
8  E12  E13  E14  E15

In [20]:
pd.concat([df4,df5])

  col1 col2 col3 col4
1   D0   D1   D2   D3
2   D4   D5   D6   D7
3   D8   D9  D10  D11
4  D12  D13  D14  D15
5   E0   E1   E2   E3
6   E4   E5   E6   E7
7   E8   E9  E10  E11
8  E12  E13  E14  E15

In [ ]:
#select col1, col2, null as col3, null as col4  from t1 union all select null as col1, null as col2, col3, col4 from t2

In [23]:
pd.concat([df4,df5],axis=1).fillna(0)

  col1 col2 col3 col4 col1 col2 col3 col4
1   D0   D1   D2   D3    0    0    0    0
2   D4   D5   D6   D7    0    0    0    0
3   D8   D9  D10  D11    0    0    0    0
4  D12  D13  D14  D15    0    0    0    0
5    0    0    0    0   E0   E1   E2   E3
6    0    0    0    0   E4   E5   E6   E7
7    0    0    0    0   E8   E9  E10  E11
8    0    0    0    0  E12  E13  E14  E15

In [ ]:
#select t1.*, t2.* from t1 inner join t2 on t1.id = t2.key

In [24]:
colunas = ['id','nome','numero']
dados1 = [[0,'a',55.0,],[1,'b',12.0],[2,'c',98.5]]
dados2 = [[0,'a',32.8],[2,'d',871.9],[4,'e',812.123]]
left = pd.DataFrame(dados1,columns=colunas)
right = pd.DataFrame(dados2,columns=colunas)

In [25]:
left

   id nome  numero
0   0    a    55.0
1   1    b    12.0
2   2    c    98.5

In [26]:
right

   id nome   numero
0   0    a   32.800
1   2    d  871.900
2   4    e  812.123

In [27]:
pd.merge(left,right,how='inner',on='id')

   id nome_x  numero_x nome_y  numero_y
0   0      a      55.0      a      32.8
1   2      c      98.5      d     871.9

In [ ]:
#select t1.*, t2.* from t1 left join t2 on t1.id = t2.key

In [31]:
pd.merge(left,right,how='left',on='id').fillna('null')

   id nome_x  numero_x nome_y numero_y
0   0      a      55.0      a     32.8
1   1      b      12.0   null     null
2   2      c      98.5      d    871.9

In [ ]:
#select t1.*, t2.* from t1 right join t2 on t1.id = t2.key

In [44]:
pd.merge(left,right,how='right',left_on='id',right_on = 'id').fillna('null')

   id nome_x numero_x nome_y  numero_y
0   0      a       55      a    32.800
1   2      c     98.5      d   871.900
2   4   null     null      e   812.123

In [ ]:
#select t1.*, t2.* from t1 inner join t2 on t1.id = t2.key and t1.nome = t2.nome

In [43]:
pd.merge(left,right,how='left',on=['id','nome']).fillna('null')

   id nome  numero_x numero_y
0   0    a      55.0     32.8
1   1    b      12.0     null
2   2    c      98.5     null

In [42]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how:str='inner', on=None, left_on=None, right_on=None, left_index:bool=False, right_index:bool=False, sort:bool=False, suffixes=('_x', '_y'), copy:bool=True, indicator:bool=False, validate=None) -> 'DataFrame'
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : tuple of (str, str), default ('_x', '_y')
        Suffix to apply to overlapping column names in the left and right
        side, respectively. To raise an exception on overlapping columns use
        (False, False).
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------

    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

In [36]:
pd.merge(left,right,how='xx',on='id')

KeyError: 'xx'

In [37]:
index_df1 = ['i1','i2','i3','i4']
index_df2 = ['i1','i3','i4','i5']
dados1 =  np.array(list(map(lambda x: 'A' + str(x), range(16)))).reshape(4,4)
dados2 =  np.array(list(map(lambda x: 'B' + str(x), range(16)))).reshape(4,4)

In [38]:
df1 = pd.DataFrame(dados1,columns=['A','B','C','D'],index=index_df1)
df2 = pd.DataFrame(dados2,columns=['E','F','G','H'],index=index_df2)

In [39]:
df1

      A    B    C    D
i1   A0   A1   A2   A3
i2   A4   A5   A6   A7
i3   A8   A9  A10  A11
i4  A12  A13  A14  A15

In [40]:
df2

      E    F    G    H
i1   B0   B1   B2   B3
i3   B4   B5   B6   B7
i4   B8   B9  B10  B11
i5  B12  B13  B14  B15

In [45]:
#faz um left join pelo index
df1.join(df2)

      A    B    C    D    E    F    G    H
i1   A0   A1   A2   A3   B0   B1   B2   B3
i2   A4   A5   A6   A7  NaN  NaN  NaN  NaN
i3   A8   A9  A10  A11   B4   B5   B6   B7
i4  A12  A13  A14  A15   B8   B9  B10  B11

In [46]:
df1.join(df2,how='outer')

      A    B    C    D    E    F    G    H
i1   A0   A1   A2   A3   B0   B1   B2   B3
i2   A4   A5   A6   A7  NaN  NaN  NaN  NaN
i3   A8   A9  A10  A11   B4   B5   B6   B7
i4  A12  A13  A14  A15   B8   B9  B10  B11
i5  NaN  NaN  NaN  NaN  B12  B13  B14  B15

In [ ]:
#distinct do sql em pandas

In [47]:
dados = {'id':[111111,111111,2222222,2222222],'nomes':['anderson','ueda','miura','sandro'],'valores':[1231,545,4637,675]}
df = pd.DataFrame(dados)

In [48]:
df

        id     nomes  valores
0   111111  anderson     1231
1   111111      ueda      545
2  2222222     miura     4637
3  2222222    sandro      675

In [ ]:
#select distinct id from t1

In [49]:
df['id'].unique()

array([ 111111, 2222222], dtype=int64)

In [ ]:
#select id,count(*) from t1 group by id

In [50]:
df['id'].value_counts()

111111     2
2222222    2
Name: id, dtype: int64

In [ ]:
#select * from df1 where id = 2222222

In [51]:
df.where(df['id'] == 2222222)

          id   nomes  valores
0        NaN     NaN      NaN
1        NaN     NaN      NaN
2  2222222.0   miura   4637.0
3  2222222.0  sandro    675.0

In [52]:
df.where(df['id'] == 2222222).dropna()

          id   nomes  valores
2  2222222.0   miura   4637.0
3  2222222.0  sandro    675.0

In [ ]:
#apply, aplica uma função a todos os valores de uma coluna

In [53]:
def dobro(n):
    return n*2

In [54]:
df

        id     nomes  valores
0   111111  anderson     1231
1   111111      ueda      545
2  2222222     miura     4637
3  2222222    sandro      675

In [55]:
df['nomes'].apply(len)

0    8
1    4
2    5
3    6
Name: nomes, dtype: int64

In [56]:
df['id'].apply(dobro)

0     222222
1     222222
2    4444444
3    4444444
Name: id, dtype: int64

In [57]:
df['valores'].apply(lambda x: x**2)

0     1515361
1      297025
2    21501769
3      455625
Name: valores, dtype: int64

In [58]:
df['id'] = df['id'].apply(lambda x: x * 2)

In [59]:
df

        id     nomes  valores
0   222222  anderson     1231
1   222222      ueda      545
2  4444444     miura     4637
3  4444444    sandro      675

In [62]:
df['multic+5'] = df['valores'].apply(lambda x: x * 5 )

In [63]:
df

        id     nomes  valores  multic+5
0   222222  anderson     6155     30775
1   222222      ueda     2725     13625
2  4444444     miura    23185    115925
3  4444444    sandro     3375     16875

In [ ]:
#order by

In [66]:
df.sort_values('nomes')

        id     nomes  valores  multic+5
0   222222  anderson     6155     30775
2  4444444     miura    23185    115925
3  4444444    sandro     3375     16875
1   222222      ueda     2725     13625

In [70]:
df

        id  valores  multic+5
0   222222     6155     30775
1   222222     2725     13625
2  4444444    23185    115925
3  4444444     3375     16875

In [71]:
del df['id']

In [72]:
df

   valores  multic+5
0     6155     30775
1     2725     13625
2    23185    115925
3     3375     16875

In [73]:
a = 0

In [74]:
del a

In [75]:
a

NameError: name 'a' is not defined